org/An_introduction_to_probabilistic_programming_by_Jan-Willem_van_de_Meent,_Frank_Wood_et_al_in_2018.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: An_introduction_to_probabilistic_programming_by_Jan-Willem_van_de_Meent,_Frank_Wood_et_al_in_2018
#+TITLE: An introduction to probabilistic programming by Jan-Willem van de Meent, Frank Wood et al in 2018
* [[file:probabilistic_programming.org][probabilistic programming]], [[file:probabilistic_inference.org][probabilistic inference]], [[file:programming_languages.org][programming languages]], [[file:logic.org][logic]], [[file:Frank_Wood.org][Frank Wood]]
* citation
** van de Meent, J.-W., Paige, B., Yang, H., & Wood, F. (2018). An Introduction to Probabilistic Programming. Retrieved from http://arxiv.org/abs/1809.10756
* contents
** 0. Abstract
*** We start with a discussion of model-based reasoning and explain why conditioning as a foundational computation is central to the fields of probabilistic machine learning and artificial intelligence.
*** a simple first-order probabilistic programming language (PPL) whose programs define static-computation-graph, finite-variable* cardinality models
*** a higher-order probabilistic programming language, with a functionality analogous to that of established programming languages
*** models with dynamic computation graphs, at the cost of requiring inference methods that generate samples by repeatedly executing the program
*** interface between program executions and an inference controller
** 1. Introduction
*** 1.1 Model-based Reasoning . . . . . . . . . . . . . . . . . . . 10 
*** 1.2 Probabilistic Programming . . . . . . . . . . . . . . . . . 21 
*** 1.3 Example Applications . . . . . . . . . . . . . . . . . . . . 26 
*** 1.4 A First Probabilistic Program . . . . . . . . . . . . . . . . 29
** 2. A probabilistic programming language without recursion
*** 2.1 Syntax . . . . . . . . . . . . . . . . . . . . . . . . . . . . 32 
*** 2.2 Syntactic Sugar . . . . . . . . . . . . . . . . . . . . . . . 37 
*** 2.3 Examples . . . . . . . . . . . . . . . . . . . . . . . . . . . 42 
*** 2.4 A Simple Purely Deterministic Language . . . . . . . . . . 48
** 3. Graph-based inference
*** 3.1 Compilation to a Graphical Model . . . . . . . . . . . . . 51 
*** 3.2 Evaluating the Density . . . . . . . . . . . . . . . . . . . 66 
*** 3.3 Gibbs Sampling . . . . . . . . . . . . . . . . . . . . . . . 74 
*** 3.4 Hamiltonian Monte Carlo . . . . . . . . . . . . . . . . . . 80 
*** 3.5 Compilation to a Factor Graph . . . . . . . . . . . . . . . 89
*** 3.6 Expectation Propagation . . . . . . . . . . . . . . . . . . 94
** 4. Evaluation-based inference I
*** 4.1 Likelihood Weighting . . . . . . . . . . . . . . . . . . . . 105 
*** 4.2 Metropolis-Hastings . . . . . . . . . . . . . . . . . . . . . 116 
*** 4.3 Sequential Monte Carlo . . . . . . . . . . . . . . . . . . . 125 
*** 4.4 Black Box Variational Inference . . . . . . . . . . . . . . . 131
** 5. A probabilistic programming language with recursion
*** 5.1 Syntax . . . . . . . . . . . . . . . . . . . . . . . . . . . . 142 
*** 5.2 Syntactic sugar . . . . . . . . . . . . . . . . . . . . . . . 143 
*** 5.3 Examples . . . . . . . . . . . . . . . . . . . . . . . . . . . 144
** 6. Evaluation-based inference II
*** 6.1 Explicit separation of model and inference code . . . . . . 156 
*** 6.2 Addressing Transformation . . . . . . . . . . . . . . . . . 161 
*** 6.3 Continuation-Passing-Style Transformation . . . . . . . . . 165 
*** 6.4 Message Interface Implementation . . . . . . . . . . . . . 171 
*** 6.5 Likelihood Weighting . . . . . . . . . . . . . . . . . . . . 175 
*** 6.6 Metropolis-Hastings . . . . . . . . . . . . . . . . . . . . . 175 
*** 6.7 Sequential Monte Carlo . . . . . . . . . . . . . . . . . . . 178
** 7. Advanced topics
*** 7.1 Inference Compilation . . . . . . . . . . . . . . . . . . . . 181
*** 7.2 Model Learning . . . . . . . . . . . . . . . . . . . . . . . 186
*** 7.3 Hamiltonian Monte Carlo and Variational Inference . . . . 191
*** 7.4 Nesting . . . . . . . . . . . . . . . . . . . . . . . . . . . . 193
*** 7.5 Formal Semantics . . . . . . . . . . . . . . . . . . . . . . 196
** 8. Conclusion
